// Завдання: 18
/**
  
  Функція calculateTotalPrice приймає масив об'єктів товарів і повертає загальну ціну всіх товарів.
  Кожен об'єкт товару має властивість price - ціна товару.
  Використовується метод reduce() для реалізації.
  arr - вхідний масив об'єктів товарів.
  Повертає - totalPrice - загальна ціна всіх товарів.
  */
function calculateTotalPrice(arr) {
    // Перевіряємо, чи вхідний параметр є масивом, якщо ні, повертаємо 0
    // Використовуємо метод reduce() для обчислення загальної ціни
    // Додаємо ціну товару до загальної суми та повертаємо результат
    // Повертаємо загальну ціну всіх товарів
    if (!Array.isArray(arr)) {
        return 0;
    }
    arr.reduce((accumulator, element) => accumulator + element.price);
    { return accumulator; };

}
